In [1]:
import pandas as pd

### Read in Original Dataset
Source: https://www.kaggle.com/residentmario/iowa-liquor-sales?select=Iowa_Liquor_Sales.csv

In [2]:
data=pd.read_csv('Iowa_Liquor_Sales.csv')

C:\Users\josep\anaconda3\envs\ace592\lib\site-packages\IPython\core\interactiveshell.py:3146: DtypeWarning: Columns (6) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [37]:
data.head()

,Invoice/Item Number,Date,Store Number,Store Name,Address,City,Zip Code,Store Location,County Number,County,...,Item Number,Item Description,Pack,Bottle Volume (ml),State Bottle Cost,State Bottle Retail,Bottles Sold,Sale (Dollars),Volume Sold (Liters),Volume Sold (Gallons)
7773896,S09840100116,2013-01-02,4273,Smokin' Joe's #4 Tobacco and Liquor,2800 E UNIVERSITY AVE,DES MOINES,50317,2800 E UNIVERSITY AVE\nDES MOINES 50317\n(41.6...,77.0,Polk,...,19064,Jim Beam,24,375,$4.75,$7.13,3,$21.39,1.12,0.30
5090981,S09820200010,2013-01-02,4125,Wapello Jack and Jill,503 HWY 61 SOUTH,WAPELLO,52653,"503 HWY 61 SOUTH\nWAPELLO 52653\n(41.173132, -...",58.0,Louisa,...,27562,Seagrams Seven Crown Stone Cherry,12,750,$8.17,$12.26,2,$24.52,1.50,0.40
1309238,S09827000030,2013-01-02,4303,Mepo Foods,111 N WAPELLO,MEDIAPOLIS,52637,"111 N WAPELLO\nMEDIAPOLIS 52637\n(41.008749, -...",29.0,Des Moines,...,75210,Kinky Liqueur,6,750,$10.00,$15.00,4,$60.00,3.00,0.79
6139187,S09836200114,2013-01-02,2605,Hy-Vee Drugstore #5 / Cedar Rapids,2001 BLAIRS FERRY ROAD NE,CEDAR RAPIDS,52402,2001 BLAIRS FERRY ROAD NE\nCEDAR RAPIDS 52402\...,57.0,Linn,...,65200,Tequila Rose Liqueur,12,750,$10.05,$15.07,8,$120.56,6.00,1.59
2960224,S09830200006,2013-01-02,2618,Hy-Vee Drugstore #6 / Cedar Rapids,505 BOYSON RD NE,CEDAR RAPIDS,52402,505 BOYSON RD NE\nCEDAR RAPIDS 52402\n(42.0467...,57.0,Linn,...,35926,Five O'clock PET Vodka,12,750,$3.37,$5.06,12,$60.72,9.00,2.38

### Original dataset has over 1.2 million readings. We cut down the size of the original dataset by refining our timeframe and removing undesired columns of data

In [38]:
len(data)

12591077

### Convert date to "datetime" type and sort original dataset by date

In [39]:
data = data.sort_values(by="Date")

In [40]:
data['Date'] = pd.to_datetime(data['Date'])

### Remove all data before January 1, 2014

In [41]:
cleaned_data = data[~(data['Date'] < '2014-01-01')]

In [42]:
cleaned_data.head()

,Invoice/Item Number,Date,Store Number,Store Name,Address,City,Zip Code,Store Location,County Number,County,...,Item Number,Item Description,Pack,Bottle Volume (ml),State Bottle Cost,State Bottle Retail,Bottles Sold,Sale (Dollars),Volume Sold (Liters),Volume Sold (Gallons)
4724598,S16627900118,2014-01-02,2551,Hy-Vee Food Store / Chariton,2001 WEST COURT,CHARITON,50049,2001 WEST COURT\nCHARITON 50049\n,59.0,Lucas,...,86796,Southern Host Whiskey Liqueur,12,750,$5.37,$8.05,2,$16.10,1.5,0.40
4068163,S16626200245,2014-01-02,2616,Hy-Vee Food and Drug / Clinton,901 SOUTH 4TH ST,CLINTON,52732,"901 SOUTH 4TH ST\nCLINTON 52732\n(41.836268, -...",23.0,Clinton,...,11290,Crown Royal Canadian Whisky Mini,10,300,$6.90,$10.35,3,$31.05,0.9,0.24
2167995,S16622100017,2014-01-02,4265,Kwik Stop 3 / Waterloo,1104 WASHINGTON ST,WATERLOO,50702,1104 WASHINGTON ST\nWATERLOO 50702\n(42.489105...,7.0,Black Hawk,...,34006,Absolut Swedish Vodka 80 Prf,12,750,$11.49,$17.24,4,$68.96,3.0,0.79
7808151,S16625200105,2014-01-02,3692,Wilkie Liquors,724 1ST ST E,MT VERNON,52314,"724 1ST ST E\nMT VERNON 52314\n(41.91776, -91....",57.0,Linn,...,30238,Gilbey's Gin London Dry,6,1750,$10.49,$15.74,2,$31.48,3.5,0.92
7597005,S16622700187,2014-01-02,2512,Hy-Vee Wine and Spirits / Iowa City,1720 WATERFRONT DR,IOWA CITY,52240,1720 WATERFRONT DR\nIOWA CITY 52240\n(41.64277...,52.0,Johnson,...,34702,Pearl Pomegranate Vodka,12,750,$7.86,$11.79,12,$141.48,9.0,2.38

### Remove all undesired columns

In [43]:
cleaned_data = cleaned_data.drop(columns=['Invoice/Item Number', 'Store Number', 'Store Name', 'Address', 'City', 
                                          'Store Location', 'Category', 'Category Name', 'Vendor Number', 'Vendor Name', 
                                         'Item Number', 'Item Description', 'Pack', 'Bottle Volume (ml)', 'State Bottle Cost', 
                                         'State Bottle Retail', 'Bottles Sold'])

### Some counties are in uppercase. We must normalize all county text to lowercase

In [44]:
cleaned_data['County'] = cleaned_data['County'].str.lower()

In [45]:
cleaned_data.head()

,Date,Zip Code,County Number,County,Sale (Dollars),Volume Sold (Liters),Volume Sold (Gallons)
4724598,2014-01-02,50049,59.0,lucas,$16.10,1.5,0.40
4068163,2014-01-02,52732,23.0,clinton,$31.05,0.9,0.24
2167995,2014-01-02,50702,7.0,black hawk,$68.96,3.0,0.79
7808151,2014-01-02,52314,57.0,linn,$31.48,3.5,0.92
7597005,2014-01-02,52240,52.0,johnson,$141.48,9.0,2.38

### We want to aggregate on both the Sales and Volume columns. First, strip the dollar sign off the "Sale (Dollars)" column so we can convert the column values from string to float type

In [46]:
sales = [x.strip('$') for x in cleaned_data['Sale (Dollars)']]

In [47]:
cleaned_data['Sales (Dollars)'] = sales

In [48]:
cleaned_data = cleaned_data.drop(columns=['Sale (Dollars)'])

In [49]:
cleaned_data['Sales (Dollars)'] = cleaned_data['Sales (Dollars)'].astype('float')

### Aggregate total alcohol sales by date by county

In [50]:
daily_county_sales = cleaned_data.groupby(['Date','County'])['Sales (Dollars)'].sum()
daily_county_sales = daily_county_sales.reset_index()
daily_county_sales.to_csv('daily_county_sales.csv',index=False)
daily_county_sales

            Date      County  Sales (Dollars)
0     2014-01-02   allamakee           505.78
1     2014-01-02  black hawk        106479.37
2     2014-01-02       boone          4136.59
3     2014-01-02     carroll         29607.56
4     2014-01-02       cedar          4186.41
...          ...         ...              ...
30828 2017-10-31         sac          9744.54
30829 2017-10-31       sioux         20031.95
30830 2017-10-31      warren         20881.10
30831 2017-10-31     webster           989.62
30832 2017-10-31    woodbury          1054.48

[30833 rows x 3 columns]

### Aggregate total alcohol volume sold by date by county

In [51]:
daily_county_volume_l = cleaned_data.groupby(['Date','County'])['Volume Sold (Liters)'].sum()
daily_county_volume_l = daily_county_volume_l.reset_index()
daily_county_volume_l.to_csv('daily_county_volume_l.csv',index=False)
daily_county_volume_l

            Date      County  Volume Sold (Liters)
0     2014-01-02   allamakee                 38.75
1     2014-01-02  black hawk               7525.11
2     2014-01-02       boone                344.75
3     2014-01-02     carroll               2047.84
4     2014-01-02       cedar                289.57
...          ...         ...                   ...
30828 2017-10-31         sac                306.54
30829 2017-10-31       sioux                501.20
30830 2017-10-31      warren                414.57
30831 2017-10-31     webster                 55.50
30832 2017-10-31    woodbury                 10.63

[30833 rows x 3 columns]

### Aggregate total alcohol sales by month by county

In [52]:
monthly_county_sales = (cleaned_data.groupby([pd.Grouper(key='Date', freq='MS'), 'County'])['Sales (Dollars)'].sum())
monthly_county_sales = monthly_county_sales.reset_index()
monthly_county_sales.to_csv('monthly_county_sales.csv',index=False)
monthly_county_sales

           Date      County  Sales (Dollars)
0    2014-01-01       adair         29286.20
1    2014-01-01       adams          6631.54
2    2014-01-01   allamakee         47324.47
3    2014-01-01   appanoose         71855.44
4    2014-01-01     audubon         11627.08
...         ...         ...              ...
4544 2017-10-01   winnebago         43997.89
4545 2017-10-01  winneshiek         85934.71
4546 2017-10-01    woodbury        533066.44
4547 2017-10-01       worth         19501.38
4548 2017-10-01      wright         43305.26

[4549 rows x 3 columns]

### Aggregate total alcohol volume sold by month by county

In [53]:
monthly_county_volume_l = (cleaned_data.groupby([pd.Grouper(key='Date', freq='MS'), 'County'])['Volume Sold (Liters)'].sum())
monthly_county_volume_l = monthly_county_volume_l.reset_index()
monthly_county_volume_l.to_csv('monthly_county_volume_l.csv',index=False)
monthly_county_volume_l

           Date      County  Volume Sold (Liters)
0    2014-01-01       adair               2401.90
1    2014-01-01       adams                498.91
2    2014-01-01   allamakee               3923.81
3    2014-01-01   appanoose               6082.76
4    2014-01-01     audubon               1018.00
...         ...         ...                   ...
4544 2017-10-01   winnebago                813.46
4545 2017-10-01  winneshiek               1594.18
4546 2017-10-01    woodbury              10634.18
4547 2017-10-01       worth                589.33
4548 2017-10-01      wright               1167.53

[4549 rows x 3 columns]